CSI API ETABS v1
cDetailing.GetDetailedWall_OneWallStack_OneSpandrel_OneStirrupsInfo Method
 Represents Rebars in one Spandrel on a particular story , as defined in ETABS
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetDetailedWall_OneWallStack_OneSpandrel_OneStirrupsInfo(
	int WallStackIndex,
	int SpandrelIndex,
	int StirrupsIndex,
	ref double BarSize_Dia,
	ref double BarSize_Area,
	ref double BarSize_Fy,
	ref string BarSize_Notation,
	ref double X1,
	ref double X2,
	ref double Spacing,
	ref int NumberLegs
)
Function GetDetailedWall_OneWallStack_OneSpandrel_OneStirrupsInfo (
	WallStackIndex As Integer,
	SpandrelIndex As Integer,
	StirrupsIndex As Integer,
	ByRef BarSize_Dia As Double,
	ByRef BarSize_Area As Double,
	ByRef BarSize_Fy As Double,
	ByRef BarSize_Notation As String,
	ByRef X1 As Double,
	ByRef X2 As Double,
	ByRef Spacing As Double,
	ByRef NumberLegs As Integer
) As Integer
Dim instance As cDetailing
Dim WallStackIndex As Integer
Dim SpandrelIndex As Integer
Dim StirrupsIndex As Integer
Dim BarSize_Dia As Double
Dim BarSize_Area As Double
Dim BarSize_Fy As Double
Dim BarSize_Notation As String
Dim X1 As Double
Dim X2 As Double
Dim Spacing As Double
Dim NumberLegs As Integer
Dim returnValue As Integer
returnValue = instance.GetDetailedWall_OneWallStack_OneSpandrel_OneStirrupsInfo(WallStackIndex,
	SpandrelIndex, StirrupsIndex, BarSize_Dia,
	BarSize_Area, BarSize_Fy, BarSize_Notation,
	X1, X2, Spacing, NumberLegs)
int GetDetailedWall_OneWallStack_OneSpandrel_OneStirrupsInfo(
	int WallStackIndex,
	int SpandrelIndex,
	int StirrupsIndex,
	double% BarSize_Dia,
	double% BarSize_Area,
	double% BarSize_Fy,
	String^% BarSize_Notation,
	double% X1,
	double% X2,
	double% Spacing,
	int% NumberLegs
)
abstract GetDetailedWall_OneWallStack_OneSpandrel_OneStirrupsInfo :
        WallStackIndex : int *
        SpandrelIndex : int *
        StirrupsIndex : int *
        BarSize_Dia : float byref *
        BarSize_Area : float byref *
        BarSize_Fy : float byref *
        BarSize_Notation : string byref *
        X1 : float byref *
        X2 : float byref *
        Spacing : float byref *
        NumberLegs : int byref -> int
Parameters
WallStackIndex
Type: System.Int32
 Wall Stack Index
SpandrelIndex
Type: System.Int32
 Spandrel Output Index
StirrupsIndex
Type: System.Int32
 Long bar index
BarSize_Dia
Type: System.Double
 Information about the bar In bar group Dia
BarSize_Area
Type: System.Double
 Information about the bar In bar group Area
BarSize_Fy
Type: System.Double
 Information about the bar In bar group Fy
BarSize_Notation
Type: System.String
 Information about the bar In bar group Notation
X1
Type: System.Double
 Coordinates of bar start and End, in local beam axis as defined in ETABS
X2
Type: System.Double
 Coordinates of bar start and End, in local beam axis as defined in ETABS
Spacing
Type: System.Double
 Spacing
NumberLegs
Type: System.Int32
 Number of legs
Return Value
Type: Int32
Returns zero if the function is successful; otherwise it returns a nonzero value.
See Also
Reference
cDetailing Interface
ETABSv1 Namespace